-module(fish_cfg).
-export([get/1]).
get(1)->{fish_cfg,1,1,"嘟嘟鲲","你说嘴巴嘟嘟，嘟嘟嘟嘟，嘟一下就变嘟嘟鲲~",25,7,100};
get(2)->{fish_cfg,2,2,"小丑鲲","外表丑陋，与鲲界生物相处极好~",50,6.7,1500};
get(3)->{fish_cfg,3,3,"腊肠鲲","过度爱吃，导致过敏，从此变腊肠嘴~",100,6.4,6750};
get(4)->{fish_cfg,4,4,"呆萌鲲","呆萌的外表，呆萌的心~",200,6.1,17955};
get(5)->{fish_cfg,5,5,"鲨鲨鲲","海中之狼，食肉为生，极为凶猛~",400,5.7,47250};
get(6)->{fish_cfg,6,6,"蝙蝠鲲","温柔而优美，性情温和、好奇，喜欢波浪中嬉戏~",800,5.4,640000};
get(7)->{fish_cfg,7,7,"玳瑁鲲","坚硬的外壳，遇到危险会缩进刻内躲难~",1600,5.2,2688000};
get(8)->{fish_cfg,8,8,"暴牙鲲","牙齿暴露而得名，日常爱笑~",3200,5,8467200};
get(9)->{fish_cfg,9,9,"红鸭鲲","因嘴巴向前延伸而得名，游速极快~",6400,4.8,23708160};
get(10)->{fish_cfg,10,10,"双髻鲲","眼睛可观看360度范围内动向，捕猎速度极快~",12800,4.6,62233920};
get(11)->{fish_cfg,11,11,"虎鲲","具有良好的视力和嗅觉，能侦探鲲们的电磁场变化~",25600,4.4,156829478};
get(12)->{fish_cfg,12,12,"恶霸鲲","欺软怕硬，压榨弱小群体~",51200,4.2,384232222};
get(13)->{fish_cfg,13,13,"牛角鲲","以其巨大头角而得名，牛角具有攻击性~",102400,4,922157333};
get(14)->{fish_cfg,14,14,"清道鲲","海洋中的扫地鲲~",204800,3.8,2178596699};
get(15)->{fish_cfg,15,15,"天使鲲","圣洁、善良、正直，保护弱势群体~",409600,3.7,5083392298};
get(16)->{fish_cfg,16,16,"海豚鲲","啄前额头隆起，勾画出方头外观~",819200,3.6,11742636209};
get(17)->{fish_cfg,17,17,"斑点鲲","体型修长，身上有斑点~",1638400,3.5,26901312042};
get(18)->{fish_cfg,18,18,"红灯鲲","极其危险，不可靠近~",3276800,3.4,61200484895};
get(19)->{fish_cfg,19,19,"牛鲲","外表较小可爱，但尖利的下齿叼住猎物，将无法逃脱~",6553600,3.3,138407250454};
get(20)->{fish_cfg,20,20,"黑鲲","行动迟钝，总是慢一拍，但力大无比~",13107200,3.2,311416313522};
get(21)->{fish_cfg,21,21,"饕餮鲲","无比贪婪、凶恶、阴险~",26214400,3.1,697572542289};
get(22)->{fish_cfg,22,22,"七彩神鲲","身上七彩颜色，极为漂亮~",52428800,3,1556458734988};
get(23)->{fish_cfg,23,23,"神仙鲲","拥有特殊能力，低调混迹鲲界~",104857600,2.9,3460831775433};
get(24)->{fish_cfg,24,24,"长棘鲲","遇到天敌时，会发出嘶嘶声，用来吓唬对方~",209715200,2.8,7671510435544};
get(25)->{fish_cfg,25,25,"神奇鲲","神奇宝贝的化身，今生为鲲~",419430400,2.7,16958075699623};
get(26)->{fish_cfg,26,26,"魔鬼鲲","邪恶势力的代表，破坏鲲界生态~",838860800,2.6,37392556917670};
get(27)->{fish_cfg,27,27,"蝴蝶鲲","游动姿态如蝶而得名~",1677721600,2.5,82263625218875};
get(28)->{fish_cfg,28,28,"座头鲲","以其跃出水面姿势、超长的双翅与复杂的叫声而闻名~",3355443200,2.4,180606049912348};
get(29)->{fish_cfg,29,29,"刺甲鲲","热爱捕捉小型鲲，被遇到都逃脱不掉~",6710886400,2.3,395762822416622};
get(30)->{fish_cfg,30,30,"幽灵鲲","外表奇特，行踪神秘~",13421772800,2.2,865731174036362};
get(31)->{fish_cfg,31,31,"独角鲲","头顶螺旋角及美丽多姿的外表，成为鲲中神兽~",26843545600,2.1,1890756884095410};
get(32)->{fish_cfg,32,32,"海草牛鲲","以头顶有点绿、牛角蠢傻外表，隐藏自身强大实力~",53687091200,2,4123304435700380};
get(33)->{fish_cfg,33,33,"机甲鲲","24k纯金属外壳、能够对抗一切攻击~",107374182400,1.9,8979640771080840};
get(_)->{}.